In [1]:
#Importas las libreria panda para series y dataframe
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#Creas una serie-> un array de valores
countries = pd.Series (['Spain', 'Andorra', 'Gibraltar', 'Portugal','France'])
#Imprimes el objeto countries
countries

0        Spain
1      Andorra
2    Gibraltar
3     Portugal
4       France
dtype: object

In [3]:
#Especificas un indice para las diferentes variables
countries = pd.Series (['Spain', 'Andorra', 'Gibraltar', 'Portugal','France'], index = range(10, 60, 10))
countries

10        Spain
20      Andorra
30    Gibraltar
40     Portugal
50       France
dtype: object

In [4]:
#los indices tambien pueden ser caracteres
countries = pd.Series (['Spain', 'Andorra', 'Reino Unido', 'Portugal','France'], index = ['a','b','c','d','e'])
countries

a          Spain
b        Andorra
c    Reino Unido
d       Portugal
e         France
dtype: object

In [5]:
#Puedes indexar la serie con una etiqueta
countries.name = "Paises europeos"
countries

a          Spain
b        Andorra
c    Reino Unido
d       Portugal
e         France
Name: Paises europeos, dtype: object

In [6]:
#Se puede trabajar con las series como si fuesen un array en java
countries[0]

'Spain'

In [7]:
#Se pueden hacer busquedas tanto por el index como por la posicion en la que se encuentran
countries['b'] == countries[1]

True

In [8]:
#Se pueden imprimir varios elementos a la vez
countries[['a','b']]

a      Spain
b    Andorra
Name: Paises europeos, dtype: object

In [9]:
#imprimir desde inicio hasta un índice
countries[:'d']

a          Spain
b        Andorra
c    Reino Unido
d       Portugal
Name: Paises europeos, dtype: object

In [10]:
#Se pueden hacer filtros para numeros sin tener que hacer un if y un for para imprimir
numeros = pd.Series([0,1,2,3,5,12,12,34,14])
filtro= numeros > 10
numeros[filtro]

5    12
6    12
7    34
8    14
dtype: int64

In [11]:
#Se puede utlizar pandas con otras librerias con numpy
import numpy as np
np.sum(numeros)

83

In [12]:
#filtrar con np.where pero no se muy que foltra la verdad
distancias = pd.Series([12, np.nan, 12.8, 13, 7.2,1])
distancias_validas = np.where(pd.notnull(distancias), distancias, 2)
distancias_validas

array([12. ,  2. , 12.8, 13. ,  7.2,  1. ])

In [13]:
#Tambien se puede utilizar un for para imprimir
#str se utiliza para pasar a string
for value in numeros:
    print('Value: ' + str(value))

Value: 0
Value: 1
Value: 2
Value: 3
Value: 5
Value: 12
Value: 12
Value: 34
Value: 14

In [14]:
#Bucle para indices
for index in numeros.index:
    print('Index: ' + str(index))

Index: 0
Index: 1
Index: 2
Index: 3
Index: 4
Index: 5
Index: 6
Index: 7
Index: 8

In [15]:
for index,value in numeros.iteritems():
    print("Value: "+str(value)+" "+ "Index: "+str(index))

Value: 0 Index: 0
Value: 1 Index: 1
Value: 2 Index: 2
Value: 3 Index: 3
Value: 5 Index: 4
Value: 12 Index: 5
Value: 12 Index: 6
Value: 34 Index: 7
Value: 14 Index: 8

In [16]:
serie = pd.Series({'Carlos' : 100, 'Marcos' : 98})
serie

Carlos    100
Marcos     98
dtype: int64

In [17]:
#Crear una serie a partir de un diccionario
serie.index
serie.values
#Añade y elimina elementos por sus indices
serie['Pedro'] =12
del serie['Marcos']
serie

Carlos    100
Pedro      12
dtype: int64

In [18]:
#Se pueden hacer querys a los indices
if 'Carlos' in serie:
    serie['Carlos'] = 2
serie

Carlos     2
Pedro     12
dtype: int64

In [19]:
#NO se puede hacer con valores
if 2 in serie:
    serie['Carlos'] = 22
serie

Carlos     2
Pedro     12
dtype: int64

In [20]:
#Creo dos series nuevas
serie1 = pd.Series([1,2,3,4,5], index = range(5))
serie2 = pd.Series([10,20,30,40,50], index =range(5))
serie1
serie2

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [21]:
#Sumar dos series
serie1+serie2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [22]:
serie1 - serie2

0    -9
1   -18
2   -27
3   -36
4   -45
dtype: int64

In [23]:
#Aplicando otra vez un filtro
result = serie1 + serie2
filtras = result >12
filtras

0    False
1     True
2     True
3     True
4     True
dtype: bool

In [24]:
#Se le puede aplicar restricciones a los valores segun te interese
result = serie1 + serie2
result[12 >result] = 0
result

0     0
1    22
2    33
3    44
4    55
dtype: int64

In [25]:
#Para comprobar que no haya ningun valor nulo y si lo hay pasarlo a 0
result[pd.isnull(result)] = 0

In [26]:
#Declarar diccionario que es como un array indexado
diccionario = {"Nombre" : ["Esteban", "Manolo","Fernando"], "Edad" : [23,19,11]}
diccionario

{'Nombre': ['Esteban', 'Manolo', 'Fernando'], 'Edad': [23, 19, 11]}

In [27]:
#Ahora declaras el dataframe asignandole el diccionario que has creado
#Se puede indexar igual que en las series
dFrame = pd.DataFrame(diccionario, index = range(1, 4, 1))
dFrame

     Nombre  Edad
1   Esteban    23
2    Manolo    19
3  Fernando    11

In [28]:
#Se puede especificar el numeor de columnas que tenga y su orden
dFrame = pd.DataFrame(diccionario, columns=['Nacionalidad','Nombre', 'Profesion', 'Edad'])
dFrame

  Nacionalidad    Nombre Profesion  Edad
0          NaN   Esteban       NaN    23
1          NaN    Manolo       NaN    19
2          NaN  Fernando       NaN    11

In [29]:
#Acceso a una columna a traves de una variable auxiliar
nombre = dFrame.Nombre
nombre

0     Esteban
1      Manolo
2    Fernando
Name: Nombre, dtype: object

In [30]:
#Diferentes formas deacceder a los datos de un DataFrame
nombre[0]
dFrame['Nombre'][0]
dFrame.Nombre[0]#Esta es la que mas me gusta e intuitiva

'Esteban'

In [31]:
#Se pueden anaidir columnas a un DataFrame con valor por defecto
dFrame['Direccion'] = "Desconocida"
dFrame

  Nacionalidad    Nombre Profesion  Edad    Direccion
0          NaN   Esteban       NaN    23  Desconocida
1          NaN    Manolo       NaN    19  Desconocida
2          NaN  Fernando       NaN    11  Desconocida

In [32]:
#Tambien se pueden añadir filas 
user = ["Españita", "Cristina", "Estudiante", 21, "Calle ancha"]
dFrame.loc[len(dFrame)] = user
dFrame

  Nacionalidad    Nombre   Profesion  Edad    Direccion
0          NaN   Esteban         NaN    23  Desconocida
1          NaN    Manolo         NaN    19  Desconocida
2          NaN  Fernando         NaN    11  Desconocida
3     Españita  Cristina  Estudiante    21  Calle ancha

In [33]:
#Eliminar filas
dFrame = dFrame.drop(1)
dFrame

  Nacionalidad    Nombre   Profesion  Edad    Direccion
0          NaN   Esteban         NaN    23  Desconocida
2          NaN  Fernando         NaN    11  Desconocida
3     Españita  Cristina  Estudiante    21  Calle ancha

In [34]:
#Eliminar columnas
del dFrame['Direccion']
dFrame

  Nacionalidad    Nombre   Profesion  Edad
0          NaN   Esteban         NaN    23
2          NaN  Fernando         NaN    11
3     Españita  Cristina  Estudiante    21

In [35]:
dFrame.T

                    0         2           3
Nacionalidad      NaN       NaN    Españita
Nombre        Esteban  Fernando    Cristina
Profesion         NaN       NaN  Estudiante
Edad               23        11          21

In [36]:
#Imprimir las columnas con un for
for a in dFrame:
    print(a)

Nacionalidad
Nombre
Profesion
Edad

In [37]:
#Imprimir los valores de cada objeto que se le introduce
for i in dFrame.values:
    print(i)

[nan 'Esteban' nan 23]
[nan 'Fernando' nan 11]
['Españita' 'Cristina' 'Estudiante' 21]

In [38]:
#Imprimir la cabecera de la columna y sus valores
for i, j in zip(dFrame, dFrame.values):
    print(i)
    print(j)

Nacionalidad
[nan 'Esteban' nan 23]
Nombre
[nan 'Fernando' nan 11]
Profesion
['Españita' 'Cristina' 'Estudiante' 21]

In [39]:
#Crear un dataFrame con diferentes datos del mismo tipo en el mismo orden
d1 = {'ciudad':'Valencia', 'temperatura':10, 'benja':1}
d2 = {'ciudad':'Barcelona', 'temperatura':8}
d3 = {'ciudad':'Valencia', 'temperatura':9}
d4 = {'ciudad':'Madrid', 'temperatura':10, 'humedad':80}
d5 = {'ciudad':'Sevilla', 'temperatura':15, 'humedad':50, 'co2':6}
d6 = {'ciudad':'Valencia', 'temperatura':10, 'humedad':90, 'co2':10}
ls_data = [d1, d2, d3, d4, d5, d6]
df_data = pd.DataFrame(ls_data)
df_data

   benja     ciudad   co2  humedad  temperatura
0    1.0   Valencia   NaN      NaN           10
1    NaN  Barcelona   NaN      NaN            8
2    NaN   Valencia   NaN      NaN            9
3    NaN     Madrid   NaN     80.0           10
4    NaN    Sevilla   6.0     50.0           15
5    NaN   Valencia  10.0     90.0           10

In [40]:
#Acceso a un dato en concreto
print(df_data.iloc[0,0])

1.0

In [41]:
#Acceso a un conjunto de datos el primero referencia el nimero de filas
#El segundo :4 referencia las columnas que se van a mostrar
print(df_data.iloc[:3,:4])

   benja     ciudad  co2  humedad
0    1.0   Valencia  NaN      NaN
1    NaN  Barcelona  NaN      NaN
2    NaN   Valencia  NaN      NaN

In [42]:
print(df_data.loc[:2, :"humedad"])

   benja     ciudad  co2  humedad
0    1.0   Valencia  NaN      NaN
1    NaN  Barcelona  NaN      NaN
2    NaN   Valencia  NaN      NaN

In [43]:
#Ni puta idea que hace y porque sale eso rojo pero ha impreso coasas de la columna humedad
#No me parece nada util este comando la verdad
print(df_data.ix[:3, 'humedad'])

0     NaN
1     NaN
2     NaN
3    80.0
Name: humedad, dtype: float64

C:\Users\cp\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

In [44]:
#Imprimir de diferentes formas
dFrame['Edad']

0    23
2    11
3    21
Name: Edad, dtype: int64

In [45]:
dFrame

  Nacionalidad    Nombre   Profesion  Edad
0          NaN   Esteban         NaN    23
2          NaN  Fernando         NaN    11
3     Españita  Cristina  Estudiante    21

In [47]:
#axis como argumento

In [46]:
#Imprime la priemera fila la cabecera y sus valores
dFrame.iloc[0]

Nacionalidad        NaN
Nombre          Esteban
Profesion           NaN
Edad                 23
Name: 0, dtype: object

In [48]:
dFrame

  Nacionalidad    Nombre   Profesion  Edad
0          NaN   Esteban         NaN    23
2          NaN  Fernando         NaN    11
3     Españita  Cristina  Estudiante    21

In [59]:
dFrame.loc['a']
#No tiene ningun sentido porque loc trabaja con las etiquetas y en este caso
#las etiquetas son numeros como se ve en la tabla superior

KeyError: 'a'

In [66]:
dFrame['Nacionalidad']
dFrame.iloc(axis=1)[0]
#Filtro mas complejo pero hace lo mismo imprimir una columna

0         NaN
2         NaN
3    Españita
Name: Nacionalidad, dtype: object

In [75]:
frame  = pd.DataFrame({"Name" : ['Carlos','Pedro'], "Age" : [22,33]}, index=['a','b'])
frame

     Name  Age
a  Carlos   22
b   Pedro   33

In [77]:
print("Primera fila \n")
print(frame.iloc[0])

print(" \n\nFiltrar por etiqueta el primer valor")
print(frame.loc['a'])

Primera fila

Name    Carlos
Age         22
Name: a, dtype: object


Filtrar por etiqueta el primer valor
Name    Carlos
Age         22
Name: a, dtype: object

In [79]:
#Construccion de indices
ind = pd.Index([2,3,5,7,11])
#Imprimir datos
print(ind[3])
#Sin mucho sentido si son cosas matriciales puedes poner [][]
print(ind[::2])

7
Int64Index([2, 5, 11], dtype='int64')

In [102]:
d_and_d_characters = {'Name' : ['bundenth','theorin','barlok'], 'Strength' : [10,12,19], 'Wisdom' : [20,13,6]}
character_data = pd.DataFrame(d_and_d_characters, index = ['a','b','c'])
print(character_data)
print("\n")
print(character_data[:-1])
print("\n")
print(character_data[1:2])

       Name  Strength  Wisdom
a  bundenth        10      20
b   theorin        12      13
c    barlok        19       6


       Name  Strength  Wisdom
a  bundenth        10      20
b   theorin        12      13


      Name  Strength  Wisdom
b  theorin        12      13

In [106]:
character_data[['Name', 'Strength']]

       Name  Strength
a  bundenth        10
b   theorin        12
c    barlok        19

In [115]:
character_data.loc[:,'Name':'Strength']
#Los dos puntos es para que coja todas las filas

       Name  Strength
a  bundenth        10
b   theorin        12
c    barlok        19

In [119]:
character_data.loc[['a','c'], ['Wisdom', 'Name']]

   Wisdom      Name
a      20  bundenth
c       6    barlok

In [126]:
character_data.iloc[[0,2],[0,2]]

       Name  Wisdom
a  bundenth      20
c    barlok       6

In [129]:
# Como ejercicio, cómo listar los personajes con Strength > 15 o Wisdom > 11
serie = character_data[character_data['Strength']<15]
print(serie)
serie=  character_data[character_data['Wisdom']<11]
print(serie)

       Name  Strength  Wisdom
a  bundenth        10      20
b   theorin        12      13
     Name  Strength  Wisdom
c  barlok        19       6